package com.yedam.java.h01;

public interface Question3_Answer {
//	Question 1]을 이용하여 랜덤게임 프로그램을 구현하라.
//	1) 프로그램을 실행할 경우 50% 확률로 두 개의 게임 중 하나가 셋팅된다.
//		( RPGgame or ArcadeGame )
//	2) 다음과 같이 메뉴를 구성한다.
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//	3) 아래와 같이 출력결과가 나오도록 실행코드를 구현한다.
//	- 출력결과
//		PRGgame 실행
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>1
//		캐릭터가 위쪽으로 이동한다.
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>3
//		캐릭터가 한칸단위로 점프한다.
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>5
//		현재 모드 : HARD_MODE
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>3
//		캐릭터가 두칸단위로 점프한다.
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>4
//		캐릭터가 HIT 공격.
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>2
//		캐릭터가 아래쪽으로 이동한다.
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>5
//		현재 모드 : NORMAL_MODE
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>4
//		캐릭터가 일반 공격.
//		============================================================================================
//		<< 1.LeftUP | 2.LeftDown | 3.RightUp | 4.RightDown | 5.ModeChange | 0.GameChange | 9.EXIT >>
//		============================================================================================
//		choice>>9
//		EXIT
//		
//	- 조건
//		랜덤게임으로 출력결과는 실행 시 설정되는 게임에 따라 달라질 수 있다.
}
